package jp.ac.uryukyu.ie.e175750;
import java.util.Random;
public class Tintiro{
    /*チンチロという賭博のゲーム
     *まず３つのサイコロを同時に投げる
     *２つのサイコロの目が同じで他の１つ目が違う場合、その他の一つの目を自分の出目とする
     *出目がない場合はもう一度ふる(３回まで)
     *強い順番は以下の通りとする
     *1.ピンゾロ(１、１、１)
     *2.ゾロ目(全部同じ目)
     *3.シゴロ(４、５、６)
     *4.出目の大きい順番
     *5.出目なし
     *6.ヒフミ(１、２、３)　　　
     */
    public static void main(String[] args){
        Random Dice = new Random();
        int Dice1 = Dice.nextInt(6) + 1;
        int Dice2 = Dice.nextInt(6) + 1;
        int Dice3 = Dice.nextInt(6) + 1;
        int a=Dice1, b=Dice2, c=Dice3;
        if (a==4 && b==5 && c==6 || a==5 && b==4 && c==6 || a==6 && b==5 && c==4 || a==5 && b==6 && c==4 || a==4 && b==6 && c==5 || a==6 && b==4 && c==5){
            System.out.println(a+","+b+","+c+" シゴロ");
        }
        else if(a==2 && b==2 && c==2 || a==3 && b==3 && c==3 || a==4 && b==4 && c==4 || a==5 && b==5 && c==5 || a==6 && b==6 && c==6){
            System.out.println(a+","+b+","+c+" ゾロ目");
        }
        else if(a==1 && b==1 && c==1){
            System.out.println(a+","+b+","+c+" ピンゾロ");
        }
        else if(a==1 && b==2 && c==3 || a==1 && b==3 && c==2 || a==2 && b==1 && c==3 || a==2 && b==3 && c==1 || a==3 && b==1 && c==2 || a==3 && b==2 && c==1){
            System.out.println(a+","+b+","+c+" ヒフミ");
        }
        else if(a==1 && b==2 && c==2 || a==2 && b==1 && c==2 || a==2 && b==2 && c==1 ||
                a==1 && b==3 && c==3 || a==3 && b==1 && c==3 || a==3 && b==3 && c==1 ||
                a==1 && b==4 && c==4 || a==4 && b==1 && c==4 || a==4 && b==4 && c==1 ||
                a==1 && b==5 && c==5 || a==5 && b==1 && c==5 || a==5 && b==5 && c==1 ||
                a==1 && b==6 && c==6 || a==6 && b==1 && c==6 || a==6 && b==6 && c==1){
            System.out.println(a+","+b+","+c+" 出目は１");
        }
        else if(a==2 && b==1 && c==1 || a==1 && b==2 && c==1 || a==1 && b==1 && c==2 ||
                a==2 && b==3 && c==3 || a==3 && b==2 && c==3 || a==3 && b==3 && c==2 ||
                a==2 && b==4 && c==4 || a==4 && b==2 && c==4 || a==4 && b==4 && c==2 ||
                a==2 && b==5 && c==5 || a==5 && b==2 && c==5 || a==5 && b==5 && c==2 ||
                a==2 && b==6 && c==6 || a==6 && b==2 && c==6 || a==6 && b==6 && c==2){
            System.out.println(a+","+b+","+c+" 出目は２");
        }
        else if(a==3 && b==1 && c==1 || a==1 && b==3 && c==1 || a==1 && b==1 && c==3 ||
                a==3 && b==2 && c==2 || a==2 && b==3 && c==2 || a==2 && b==2 && c==3 ||
                a==3 && b==4 && c==4 || a==4 && b==3 && c==4 || a==4 && b==4 && c==3 ||
                a==3 && b==5 && c==5 || a==5 && b==3 && c==5 || a==5 && b==5 && c==3 ||
                a==3 && b==6 && c==6 || a==6 && b==3 && c==6 || a==6 && b==6 && c==3){
            System.out.println(a+","+b+","+c+" 出目は３");
        }
        else if(a==4 && b==1 && c==1 || a==1 && b==4 && c==1 || a==1 && b==1 && c==4 ||
                a==4 && b==2 && c==2 || a==2 && b==4 && c==2 || a==2 && b==2 && c==4 ||
                a==4 && b==3 && c==3 || a==3 && b==4 && c==3 || a==3 && b==3 && c==4 ||
                a==4 && b==5 && c==5 || a==5 && b==4 && c==5 || a==5 && b==5 && c==4 ||
                a==4 && b==6 && c==6 || a==6 && b==4 && c==6 || a==6 && b==6 && c==4) {
            System.out.println(a + "," + b + "," + c + " 出目は４");
        }
        else if(a==5 && b==1 && c==1 || a==1 && b==5 && c==1 || a==1 && b==1 && c==5 ||
                a==5 && b==2 && c==2 || a==2 && b==5 && c==2 || a==2 && b==2 && c==5 ||
                a==5 && b==3 && c==3 || a==3 && b==5 && c==3 || a==3 && b==3 && c==5 ||
                a==5 && b==4 && c==4 || a==4 && b==5 && c==4 || a==4 && b==4 && c==5 ||
                a==5 && b==6 && c==6 || a==6 && b==5 && c==6 || a==6 && b==6 && c==5) {
            System.out.println(a + "," + b + "," + c + " 出目は５");
        }
        else if(a==6 && b==1 && c==1 || a==1 && b==6 && c==1 || a==1 && b==1 && c==6 ||
                a==6 && b==2 && c==2 || a==2 && b==6 && c==2 || a==2 && b==2 && c==6 ||
                a==6 && b==3 && c==3 || a==3 && b==6 && c==3 || a==3 && b==3 && c==6 ||
                a==6 && b==4 && c==4 || a==4 && b==6 && c==4 || a==4 && b==4 && c==6 ||
                a==6 && b==5 && c==5 || a==5 && b==6 && c==5 || a==5 && b==5 && c==6) {
            System.out.println(a + "," + b + "," + c + " 出目は６");
        }
        else{
            System.out.println(Dice1+","+Dice2+","+Dice3+" 出目なし");
        }
    }
}


